cristianoborgescardoso/nrf52/nRF5_SDK_14.2.0_17b948a/examples/peripheral/blinky/main.c
/**
 * Copyright (c) 2014 - 2017, Nordic Semiconductor ASA
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 * 
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 * 
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 * 
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 * 
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */
/** @file
 *
 * @defgroup blinky_example_main main.c
 * @{
 * @ingroup blinky_example
 * @brief Blinky Example Application main file.
 *
 * This file contains the source code for a sample application to blink LEDs.
 *
 */

#include <stdbool.h>
#include <stdint.h>
#include "nrf_delay.h"
#include "boards.h"


#include "nrf.h"
#include "nrf_drv_gpiote.h"
#include "app_error.h"


//Tutorial1 = https://devzone.nordicsemi.com/f/nordic-q-a/19242/configuration-of-digital-input-output-pins-on-nrf52

//------------------ From Tutorial1 ------------------
#define GPIO_PIN_17     17
#define GPIO_PIN_18     18
#define GPIO_PIN_19     19
#define GPIO_PIN_20     20
#define GPIO_PIN_21     21
#define GPIO_PIN_22     22
#define GPIO_PIN_23     23
#define GPIO_PIN_24     24
#define GPIO_PIN_25     25
#define GPIO_PIN_26     26

#define GPIO_PIN_27     27
#define GPIO_PIN_28     28
#define GPIO_PIN_29     29
#define GPIO_PIN_30     30

#define S_ON     1
#define S_OFF    0

//Forum1=https://devzone.nordicsemi.com/f/nordic-q-a/20971/hi-can-anyone-please-tell-me-on-how-to-read-the-digital-input-value-from-pir-sensor-in-nrf52832
//------------------ From Forum1-END------------------

/*
uint32_t pin_value_0;
uint32_t pin_value_1;
uint32_t pin_value_2;
uint32_t pin_value_3;
uint32_t pin_value_21;
uint32_t pin_value_22;
uint32_t pin_value_23;
uint32_t pin_value_24;
uint32_t pin_value_25;
uint32_t pin_value_26;
uint32_t pin_value_27;*/

void startSensors(void)
{
  nrf_gpio_cfg_input (BSP_BUTTON_0, NRF_GPIO_PIN_NOPULL);
  nrf_gpio_cfg_input (BSP_BUTTON_1, NRF_GPIO_PIN_NOPULL);
  nrf_gpio_cfg_input (BSP_BUTTON_2, NRF_GPIO_PIN_NOPULL);
  nrf_gpio_cfg_input (BSP_BUTTON_3, NRF_GPIO_PIN_NOPULL);
  nrf_gpio_cfg_input (GPIO_PIN_21, NRF_GPIO_PIN_NOPULL);
  nrf_gpio_cfg_input (GPIO_PIN_22, NRF_GPIO_PIN_NOPULL);
  nrf_gpio_cfg_input (GPIO_PIN_23, NRF_GPIO_PIN_NOPULL);
  nrf_gpio_cfg_input (GPIO_PIN_24, NRF_GPIO_PIN_NOPULL);
  nrf_gpio_cfg_input (GPIO_PIN_25, NRF_GPIO_PIN_NOPULL);
  nrf_gpio_cfg_input (GPIO_PIN_26, NRF_GPIO_PIN_NOPULL);
  nrf_gpio_cfg_input (GPIO_PIN_27, NRF_GPIO_PIN_NOPULL);

 /* pin_value_0 = nrf_gpio_pin_read (BSP_BUTTON_0);
  pin_value_1 = nrf_gpio_pin_read (BSP_BUTTON_1);
  pin_value_2 = nrf_gpio_pin_read (BSP_BUTTON_2);
  pin_value_3 = nrf_gpio_pin_read (BSP_BUTTON_3);
  pin_value_21 = nrf_gpio_pin_read (GPIO_PIN_21);
  pin_value_22 = nrf_gpio_pin_read (GPIO_PIN_22);
  pin_value_23 = nrf_gpio_pin_read (GPIO_PIN_23);
  pin_value_24 = nrf_gpio_pin_read (GPIO_PIN_24);
  pin_value_25 = nrf_gpio_pin_read (GPIO_PIN_25);
  pin_value_26 = nrf_gpio_pin_read (GPIO_PIN_26);
  pin_value_27 = nrf_gpio_pin_read (GPIO_PIN_27);*/
}


//------------------ From Forum1-END------------------


void gpio_init_group(void)
{ 
   // Pins as outputs
   //nrf_gpio_range_cfg_input(27,30,NRF_GPIO_PIN_PULLUP);
   nrf_gpio_range_cfg_input(0,30,NRF_GPIO_PIN_PULLUP);
   
   // Pins as inputs
   //nrf_gpio_range_cfg_output(17, 24);
			
}
//------------------ From Tutorial1-END------------------



//From examples/peripherical/uart
#include <stdio.h>
#include "app_uart.h"
#include "app_error.h"
#include "bsp.h"
#if defined (UART_PRESENT)
#include "nrf_uart.h"
#endif

//From examples/ble_peripherical/ble_app_uart
#include "nordic_common.h"
#include "ble_dis.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "app_timer.h"
#include "ble_nus.h"
#include "app_util_platform.h"
#include "bsp_btn_ble.h"


#if defined (UARTE_PRESENT)
#include "nrf_uarte.h"
#endif

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#define APP_BLE_CONN_CFG_TAG            1                                           /**< A tag identifying the SoftDevice BLE configuration. */

